### 📖 Terraform Plan (infra-pe/resources/uat) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.cgn_pe_fe.azurerm_cdn_frontdoor_route.this will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "this" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Cdn/profiles/io-u-itn-cgn-pe-frontend-afd-01/ruleSets/ruleset",
        ] -> (known after apply)
        id                              = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Cdn/profiles/io-u-itn-cgn-pe-frontend-afd-01/afdEndpoints/io-u-itn-cgn-pe-frontend-assets-fde-01/routes/io-u-itn-cgn-pe-frontend-assets-cdnr-01"
        name                            = "io-u-itn-cgn-pe-frontend-assets-cdnr-01"
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cgn_pe_fe.azurerm_cdn_frontdoor_rule.caching will be created
  + resource "azurerm_cdn_frontdoor_rule" "caching" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Cdn/profiles/io-u-itn-cgn-pe-frontend-afd-01/ruleSets/ruleset"
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "Caching"
      + order                       = 5

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Cache-Control"
              + value         = "no-cache"
            }
          + route_configuration_override_action {
              + cache_behavior                = "HonorOrigin"
              + compression_enabled           = true
              + query_string_caching_behavior = "IgnoreQueryString"
            }
        }

      + conditions {
          + request_uri_condition {
              + negate_condition = false
              + operator         = "Any"
            }
        }
    }

  # module.cgn_pe_fe.azurerm_cdn_frontdoor_rule.enforce_https will be created
  + resource "azurerm_cdn_frontdoor_rule" "enforce_https" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Cdn/profiles/io-u-itn-cgn-pe-frontend-afd-01/ruleSets/ruleset"
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "EnforceHTTPS"
      + order                       = 2

      + actions {
          + url_redirect_action {
              + redirect_protocol    = "Https"
              + redirect_type        = "Found"
                # (1 unchanged attribute hidden)
            }
        }

      + conditions {
          + request_scheme_condition {
              + match_values     = [
                  + "HTTP",
                ]
              + negate_condition = false
              + operator         = "Equal"
            }
        }
    }

  # module.cgn_pe_fe.azurerm_cdn_frontdoor_rule.enforce_https_assets will be created
  + resource "azurerm_cdn_frontdoor_rule" "enforce_https_assets" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "EnforceHTTPS"
      + order                       = 2

      + actions {
          + url_redirect_action {
              + redirect_protocol    = "Https"
              + redirect_type        = "Found"
                # (1 unchanged attribute hidden)
            }
        }

      + conditions {
          + request_scheme_condition {
              + match_values     = [
                  + "HTTP",
                ]
              + negate_condition = false
              + operator         = "Equal"
            }
        }
    }

  # module.cgn_pe_fe.azurerm_cdn_frontdoor_rule.global will be created
  + resource "azurerm_cdn_frontdoor_rule" "global" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Cdn/profiles/io-u-itn-cgn-pe-frontend-afd-01/ruleSets/ruleset"
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "Global"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000"
            }
        }
    }

  # module.cgn_pe_fe.azurerm_cdn_frontdoor_rule.global_assets will be created
  + resource "azurerm_cdn_frontdoor_rule" "global_assets" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "Global"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000"
            }
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Content-Security-Policy-Report-Only"
              + value         = "default-src 'self'; frame-ancestors 'self'; script-src 'self'; style-src 'self'"
            }
          + route_configuration_override_action {
              + cache_behavior                = "OverrideAlways"
              + compression_enabled           = false
              + query_string_caching_behavior = "IgnoreQueryString"
            }
        }
    }

  # module.cgn_pe_fe.azurerm_cdn_frontdoor_rule.profile_images_cache will be created
  + resource "azurerm_cdn_frontdoor_rule" "profile_images_cache" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "ProfileImagesCache"
      + order                       = 3

      + actions {
          + route_configuration_override_action {
              + cache_behavior                = "OverrideAlways"
              + compression_enabled           = false
              + query_string_caching_behavior = "IgnoreQueryString"
            }
        }

      + conditions {
          + request_uri_condition {
              + match_values     = [
                  + "/profileimages",
                ]
              + negate_condition = false
              + operator         = "BeginsWith"
            }
        }
    }

  # module.cgn_pe_fe.azurerm_cdn_frontdoor_rule.rewrite_admin_rout will be created
  + resource "azurerm_cdn_frontdoor_rule" "rewrite_admin_rout" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Cdn/profiles/io-u-itn-cgn-pe-frontend-afd-01/ruleSets/ruleset"
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "RewriteAdminRoute"
      + order                       = 4

      + actions {
          + url_rewrite_action {
              + destination             = "/index.html"
              + preserve_unmatched_path = false
              + source_pattern          = "/admin/"
            }
        }

      + conditions {
          + request_uri_condition {
              + match_values     = [
                  + "/admin/",
                ]
              + negate_condition = false
              + operator         = "Contains"
            }
        }
    }

  # module.cgn_pe_fe.azurerm_cdn_frontdoor_rule.rewrite_session_rout will be created
  + resource "azurerm_cdn_frontdoor_rule" "rewrite_session_rout" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Cdn/profiles/io-u-itn-cgn-pe-frontend-afd-01/ruleSets/ruleset"
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "RewriteSessionRoute"
      + order                       = 3

      + actions {
          + url_rewrite_action {
              + destination             = "/index.html"
              + preserve_unmatched_path = false
              + source_pattern          = "/session"
            }
        }

      + conditions {
          + request_uri_condition {
              + match_values     = [
                  + "/session",
                ]
              + negate_condition = false
              + operator         = "Contains"
            }
        }
    }

  # module.cgn_pe_fe.azurerm_cdn_frontdoor_rule_set.assets_ruleset will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "assets_ruleset" {
      + cdn_frontdoor_profile_id = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Cdn/profiles/io-u-itn-cgn-pe-frontend-afd-01"
      + id                       = (known after apply)
      + name                     = "assetsruleset"
    }

  # module.dns_weu.azurerm_private_dns_zone.private_dns_zones["pep_azure_api_net"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.azure-api.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "cgnonboardingportal-u-vnet-rg"
      + tags                                                  = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Uat"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }

      + soa_record (known after apply)
    }

  # module.dns_weu.azurerm_private_dns_zone_virtual_network_link.private_dns_links["pep_azure_api_net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "cgnonboardingportal-u-vnet"
      + private_dns_zone_name = "privatelink.azure-api.net"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "cgnonboardingportal-u-vnet-rg"
      + tags                  = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Uat"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
      + virtual_network_id    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/cgnonboardingportal-u-vnet-rg/providers/Microsoft.Network/virtualNetworks/cgnonboardingportal-u-vnet"
    }

  # module.cgn_pe_apim.module.apim.azurerm_api_management.this will be updated in-place
  ~ resource "azurerm_api_management" "this" {
        id                            = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.ApiManagement/service/io-u-itn-cgn-pe-apim-01"
      + min_api_version               = "2021-08-01"
        name                          = "io-u-itn-cgn-pe-apim-01"
      ~ tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Uat"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_api_management"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "2.0.0" -> "2.0.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
        # (20 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.cgn_pe_apim.module.apim.azurerm_network_security_group.nsg_apim will be updated in-place
  ~ resource "azurerm_network_security_group" "nsg_apim" {
        id                  = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/networkSecurityGroups/io-u-itn-cgn-pe-apim-nsg-01"
        name                = "io-u-itn-cgn-pe-apim-nsg-01"
      ~ tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Uat"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_api_management"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "2.0.0" -> "2.0.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
        # (3 unchanged attributes hidden)
    }

  # module.cgn_pe_apim.module.apim.azurerm_private_dns_a_record.apim_azure_api_net will be updated in-place
  ~ resource "azurerm_private_dns_a_record" "apim_azure_api_net" {
        id                  = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/azure-api.net/A/io-u-itn-cgn-pe-apim-01"
        name                = "io-u-itn-cgn-pe-apim-01"
      ~ tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Uat"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_api_management"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "2.0.0" -> "2.0.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
        # (5 unchanged attributes hidden)
    }

  # module.cgn_pe_apim.module.apim.azurerm_private_dns_a_record.apim_management_azure_api_net will be updated in-place
  ~ resource "azurerm_private_dns_a_record" "apim_management_azure_api_net" {
        id                  = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/management.azure-api.net/A/io-u-itn-cgn-pe-apim-01"
        name                = "io-u-itn-cgn-pe-apim-01"
      ~ tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Uat"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_api_management"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "2.0.0" -> "2.0.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
        # (5 unchanged attributes hidden)
    }

  # module.cgn_pe_apim.module.apim.azurerm_private_dns_a_record.apim_scm_azure_api_net will be updated in-place
  ~ resource "azurerm_private_dns_a_record" "apim_scm_azure_api_net" {
        id                  = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/scm.azure-api.net/A/io-u-itn-cgn-pe-apim-01"
        name                = "io-u-itn-cgn-pe-apim-01"
      ~ tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Uat"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_api_management"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "2.0.0" -> "2.0.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
        # (5 unchanged attributes hidden)
    }

  # module.cgn_pe_apim.module.apim.azurerm_private_endpoint.apim_pep[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "apim_pep" {
        id                            = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateEndpoints/io-u-itn-cgn-pe-apim-pep-01"
        name                          = "io-u-itn-cgn-pe-apim-pep-01"
      ~ tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Uat"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_api_management"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "2.0.0" -> "2.0.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 11 to add, 7 to change, 0 to destroy.
```

</details>
